# Install pandas

#### You can install pandas in Python by using pip. Run the following command in cmd:
pip install pandas

#### Also, you can install pandas using conda like this:
conda install pandas

# Read Excel file

### 1. Create an Excel sheet with the following contents:

### 2. Import the pandas module:

In [2]:
import pandas as pd

### 3. Nowpass the name of the Excel file and the sheet number we need to read data from to the read_excel() method.

In [2]:
#pd.read_excel('pandasExcel.xlsx', 'Sheet1')

# Select rows by value

In [19]:
frame_data = {'name': ['James', 'Jason', 'Rogers'], 'age': [18, 'two', 22], 'job': ['Assistant', 'Manager', 'Clerk']}

df = pd.DataFrame(frame_data)

In [20]:
df

     name  age        job
0   James   18  Assistant
1   Jason  two    Manager
2  Rogers   22      Clerk

To select a row based on value, run the following statement:

In [6]:
f=df['name'] == 'Jason'
df[f]

    name  age      job
1  Jason   20  Manager

# Select row by index

letâ€™s access a row using df.loc[]:

In [16]:
df.loc[1:2,'age']

1    20
2    22
Name: age, dtype: int64

 Select using the slicing operator as follows:

In [10]:
df[[0,1,2]]

     name  age        job
0   James   18  Assistant
1   Jason   20    Manager
2  Rogers   22      Clerk

# Change column type

In [21]:
df.dtypes

name    object
age     object
job     object
dtype: object

In [22]:
df

     name  age        job
0   James   18  Assistant
1   Jason  two    Manager
2  Rogers   22      Clerk

Now to convert the data type from one to another:

In [18]:
df.name = df.name.astype(str)

We fetched the columnâ€™ nameâ€™ from our DataFrame and changed its data type from object to string.

# Apply a function to columns/rows

In [23]:
frame_data2 = {'A': [1, 2, 3], 'B': [18, 20, 22], 'C': [54, 12, 13]}
df2 = pd.DataFrame(frame_data2)
df2

   A   B   C
0  1  18  54
1  2  20  12
2  3  22  13

We created a DataFrame and added values of integer type in the rows. To apply a function for example square root on the values, we will import the numpy module to use the sqrt function from it like this:

In [24]:
import numpy as np
df2.apply(np.sqrt)

          A         B         C
0  1.000000  4.242641  7.348469
1  1.414214  4.472136  3.464102
2  1.732051  4.690416  3.605551

To apply the sum function, the code will be:

In [25]:
df2.apply(np.sum)

A     6
B    60
C    79
dtype: int64

To apply the function to a specific column, you can specify the column like this:

In [26]:
df2['A'].apply(np.sqrt)

0    1.000000
1    1.414214
2    1.732051
Name: A, dtype: float64

# Sort Values/sort by column

To sort values in a DataFrame, use the sort_values() method of the DataFrame.

Create a DataFrame with integer values:

In [31]:
frame_data3 = {'A': [23, 12, 30], 'B': [18, 20, 22], 'C': [54, 112, 13]}
df3 = pd.DataFrame(frame_data3)

Now to sort the values:

In [37]:
df3.sort_values(by=['A'], inplace=True)

In [38]:
df3

    A   B    C
1  12  20  112
0  23  18   54
2  30  22   13

In [31]:
df3.sort_values(by=['B'])

    A   B    C
0  23  18   54
1  12  20  112
2  30  22   13

In [24]:
df3.sort_values(by=['C'])

    A   B    C
2  30  22   13
0  23  18   54
1  12  20  112

In the code above, the values are sorted by column A. To sort by multiple columns; the code will be:

In [39]:
df3.sort_values(by=['A','B'])

    A   B    C
1  12  20  112
0  23  18   54
2  30  22   13

If you want to sort in descending order, set ascending attributed of set_values to False as follows:

In [33]:
df3.sort_values(by=['A'], ascending=False)

    A   B    C
2  30  22   13
0  23  18   54
1  12  20  112

# Drop/Remove duplicates

To drop duplicate rows from a DataFrame, use the drop_duplicates() method of the DataFrame.

Consider the following example:

In [47]:
frame_data = {'name': ['James', 'Jason', 'Rogers', 'Jason'], 'age': [18, 20, 22, 20], 'job': ['Assistant', 'Manager', 'Clerk', 'Manager']}
df = pd.DataFrame(frame_data)
df

     name  age        job
0   James   18  Assistant
1   Jason   20    Manager
2  Rogers   22      Clerk
3   Jason   20    Manager

In [48]:
df.duplicated()

0    False
1    False
2    False
3     True
dtype: bool

It can be seen that the last row is a duplicate. To drop or remove this row, run the following line of code:

In [49]:
df.drop_duplicates()

     name  age        job
0   James   18  Assistant
1   Jason   20    Manager
2  Rogers   22      Clerk

In [50]:
df

     name  age        job
0   James   18  Assistant
1   Jason   20    Manager
2  Rogers   22      Clerk
3   Jason   20    Manager

# Drop duplicates by column

Sometimes, we have data where the column values are the same and we wish to delete them. We can drop a row by column by passing the name of the column we need to delete.

For example, we have the following DataFrame:

In [51]:
frame_data = {'name': ['James', 'Jason', 'Rogers', 'Jason'], 'age': [18, 20, 22, 21], 'job': ['Assistant', 'Manager', 'Clerk', 'Employee']}
df=pd.DataFrame(frame_data)
df

     name  age        job
0   James   18  Assistant
1   Jason   20    Manager
2  Rogers   22      Clerk
3   Jason   21   Employee

In [52]:
df.drop_duplicates(['name'])

     name  age        job
0   James   18  Assistant
1   Jason   20    Manager
2  Rogers   22      Clerk

# Delete a column

To delete an entire column or row, we can use the drop() method of the DataFrame by specifying the name of the column or row.

Consider the following example:

In [55]:
df.drop(['job'], axis=1)

     name  age
0   James   18
1   Jason   20
2  Rogers   22
3   Jason   21

In [51]:
df

     name  age        job
0   James   18  Assistant
1   Jason   20    Manager
2  Rogers   22      Clerk
3   Jason   21   Employee

In [53]:
df.drop(['job'], axis='columns')

     name  age
0   James   18
1   Jason   20
2  Rogers   22
3   Jason   21

In this line of code, we are deleting the column named â€˜jobâ€™ The axis argument is necessary here. If the axis value is 1, it means we want to delete columns. If the axis value is 0, it means that row will be deleted. In axis values, 0 is for index and 1 is for columns.

# Delete rows

In [57]:
frame_data={'name': ['James', 'Jason', 'Rogers'], 'age': [18, 20, 22], 'job': ['Assistant', 'Manager', 'Clerk']}
df=pd.DataFrame(frame_data)
df

     name  age        job
0   James   18  Assistant
1   Jason   20    Manager
2  Rogers   22      Clerk

To drop a row with index 0 where the name is James, age is 18, and the job is Assistant, use the following code:

In [58]:
df.drop([0])

     name  age      job
1   Jason   20  Manager
2  Rogers   22    Clerk

## Letâ€™s create a DataFrame where the indexes are the names:

In [56]:
frame_data = {'name': ['James', 'Jason', 'Rogers'], 'age': [18, 20, 22], 'job': ['Assistant', 'Manager', 'Clerk']}
df = pd.DataFrame(frame_data, index = ['James', 'Jason', 'Rogers'])
df

          name  age        job
James    James   18  Assistant
Jason    Jason   20    Manager
Rogers  Rogers   22      Clerk

Now we can delete a row with a certain value. For example, if we want to delete a row where the name is Rogers, then the code will be:

In [62]:
df.drop(['Jason'])

          name  age        job
James    James   18  Assistant
Rogers  Rogers   22      Clerk

You can also delete a range of row as:

In [65]:
df.drop(['James', 'Rogers'])

        name  age      job
Jason  Jason   20  Manager

If you want to delete the last row from the DataFrame and do not know what the total number of rows is, then you can use the negative indexing as below:

In [67]:
df.drop([df.index[-1]])

        name  age        job
James  James   18  Assistant
Jason  Jason   20    Manager

# Sum a column

You can use the sum() method of the DataFrame to sum the column items.

Suppose we have the following DataFrame:

In [58]:
frame_data = {'A': [23, 12, 12], 'B': [18, 18, 22], 'C': [13, 112, 13]}
df=pd.DataFrame(frame_data)
df

    A   B    C
0  23  18   13
1  12  18  112
2  12  22   13

Now to sum the items of column A, use the following line of code:

In [60]:
df['A'].sum()

47

In [61]:
df['A'].median()

12.0

In [62]:
df.median()

A    12.0
B    18.0
C    13.0
dtype: float64

You can also use the apply() method of the DataFrame and pass in the sum method of numpy to sum the values.

# Count unique values

To count unique values in a column, you can use the nunique() method of the DataFrame.

Suppose we have DataFrame as below:

### To count the unique values in column A:

In [63]:
df['A'].unique()

array([23, 12])

In [73]:
df['A'].nunique()

2

### If you want to count all the values in a column, you can use the count() method as follows:

In [76]:
df['A'].count

<bound method Series.count of 0    23
1    12
2    12
Name: A, dtype: int64>

# Subset rows

To select a subset of a DataFrame, You can use the square brackets.

For example, we have a DataFrame that contains some integers. We can select or subset a row like this:

df.[start:count]

The start point will be included in the subset, but the stop point is not included.
For example, to select three rows starting from the first row, you will write:

In [64]:
df[0:2]

    A   B    C
0  23  18   13
1  12  18  112

In [78]:
df[0:2]

    A   B    C
0  23  18   13
1  12  18  112

To select or subset the last row, use the negative indexing as:

In [80]:
df[-1:]

    A   B   C
2  12  22  13

# Write to Excel

In [65]:
df.to_excel("myexcel.xlsx", "pandas")

# Write to CSV

In [66]:
df.to_csv("pandasCSV.csv")

# Write to SQL

In [67]:
import sqlite3 as sq
con = sq.connect('mydatabase.db')
df.to_sql('users', con)

# Write to JSON

In [68]:
df.to_json("myJson.json")

# Write to HTML file

In [69]:
df.to_html("myhtml.html")